tutorials/surfaceTracking/interTrackFoam/sloshing2D/constant/faMesh/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/faMesh";
    object      faMeshDefinition;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

polyMeshPatches  1( freeSurface );

boundary
{
    left
    {
        type                patch;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  leftWall;
    }

    right
    {
        type                patch;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  rightWall;
    }

    frontAndBack
    {
        type                empty;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  frontAndBack;
    }
}


// ************************************************************************** //
